{
 "metadata": {
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  },
  "orig_nbformat": 4,
  "kernelspec": {
   "name": "python3",
   "display_name": "Python 3.8.5 64-bit ('pwc-conversion': conda)"
  },
  "interpreter": {
   "hash": "d7d1ce6b838bce0d0a1611437c6759461d23eef7b1262337623bc7843e4bab38"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2,
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "source": [
    "import os\r\n",
    "import random\r\n",
    "import string\r\n",
    "import re\r\n",
    "import requests\r\n",
    "import gzip\r\n",
    "import shutil\r\n",
    "import json\r\n",
    "import types\r\n",
    "import datetime\r\n",
    "import decimal\r\n",
    "import pandas as pd\r\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\r\n",
    "\r\n",
    "endpoint = \"http://localhost:9999/blazegraph/sparql\"  # SPARQL endpoint hosting previous version of ITO.owl\r\n",
    "prefixes = \"\"\"\r\n",
    "prefix owl: <http://www.w3.org/2002/07/owl#>\r\n",
    "prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#>\r\n",
    "prefix xsd: <http://www.w3.org/2001/XMLSchema#>\r\n",
    "prefix ito: <https://identifiers.org/ito:>\r\n",
    "prefix edam: <http://edamontology.org/>\r\n",
    "prefix obo: <http://www.geneontology.org/formats/oboInOwl#>\r\n",
    "prefix dc: <http://purl.org/dc/elements/1.1/>\r\n",
    "\"\"\"\r\n",
    "\r\n",
    "\r\n",
    "def query(query, return_format = JSON):\r\n",
    "    sparql = SPARQLWrapper(endpoint)\r\n",
    "    sparql.method = 'POST'\r\n",
    "    sparql.setReturnFormat(return_format)\r\n",
    "    sparql.setQuery(prefixes + query)\r\n",
    "    results = sparql.query().convert()\r\n",
    "    return results\r\n",
    "\r\n",
    "\r\n",
    "def query_df(query, numeric_cols = []):\r\n",
    "    # Run SPARQL query, and convert results to Pandas dataframe\r\n",
    "    sparql = SPARQLWrapper(endpoint)\r\n",
    "    sparql.method = 'POST'\r\n",
    "    sparql.setReturnFormat(JSON)\r\n",
    "    sparql.setQuery(prefixes + query)\r\n",
    "    results = sparql.query()\r\n",
    "    processed_results = json.load(results.response)\r\n",
    "    cols = processed_results['head']['vars']\r\n",
    "\r\n",
    "    out = []\r\n",
    "    for row in processed_results['results']['bindings']:\r\n",
    "        item = []\r\n",
    "        for c in cols:\r\n",
    "            item.append(row.get(c, {}).get('value'))\r\n",
    "        out.append(item)\r\n",
    "        \r\n",
    "    df = pd.DataFrame(out, columns=cols)\r\n",
    "    for col in numeric_cols:\r\n",
    "        df[col] = pd.to_numeric(df[col])\r\n",
    "    \r\n",
    "    return df\r\n",
    "\r\n",
    "\r\n",
    "def query_if_iri_exists(iri):\r\n",
    "    q = \"\"\"ASK FROM <tag:ITO> {\r\n",
    "    VALUES (?r) { (<\"\"\" + iri + \"\"\">) }\r\n",
    "        { ?r ?p ?o }\r\n",
    "        UNION\r\n",
    "        { ?s ?r ?o }\r\n",
    "        UNION\r\n",
    "        { ?s ?p ?r }\r\n",
    "    } \"\"\"\r\n",
    "    return query(q)['boolean']\r\n",
    "\r\n",
    "\r\n",
    "def query_entites_with_pwc_label(pwc_label):\r\n",
    "    q = 'SELECT ?x FROM <tag:ITO> WHERE { ?x ito:papers_with_code_id \"' + escape(pwc_label.strip()) + '\" }'  #.strip() added because some part of process (WebProtege?) seem to strip whitespace without user intent\r\n",
    "    r = query(q)\r\n",
    "    if len(r['results']['bindings']) > 1:\r\n",
    "        raise Exception(\r\n",
    "            f\"query_entites_with_pwc_label: It seems like there are multiple existing entities for {pwc_label}!\")\r\n",
    "    elif len(r['results']['bindings']) == 0:\r\n",
    "        return None\r\n",
    "    else:\r\n",
    "        return r['results']['bindings'][0]['x']['value']\r\n",
    "\r\n",
    "\r\n",
    "def query_label(iri):\r\n",
    "    q = 'SELECT ?label FROM <tag:ITO> WHERE { <' + iri + '> rdfs:label ?label }'\r\n",
    "    r = query(q)\r\n",
    "    if len(r['results']['bindings']) == 0:\r\n",
    "        return None\r\n",
    "    else:\r\n",
    "        return r['results']['bindings'][0]['label']['value']\r\n",
    "\r\n",
    "\r\n",
    "def add_triple(raw_sparql_fragment):\r\n",
    "    query(\"INSERT DATA { GRAPH <tag:ITO> { \" + raw_sparql_fragment + \" }  } \")\r\n",
    "\r\n",
    "\r\n",
    "def find_new_iri_fragment(prefix, number_format='{:05}'):\r\n",
    "    # Find new unique IRI fragment (e.g., 'ITO_00101'), start trying with global increment variable i\r\n",
    "    global iri_increment\r\n",
    "    while True:\r\n",
    "        candidate_iri = prefix + number_format.format(iri_increment)\r\n",
    "        if query_if_iri_exists(candidate_iri) == True:\r\n",
    "            iri_increment += 1\r\n",
    "        else:\r\n",
    "            break\r\n",
    "    return candidate_iri\r\n",
    "\r\n",
    "\r\n",
    "def clean_metric_value(metric_value):\r\n",
    "    if len(metric_value) == 0:\r\n",
    "        raise ValueError(\"Metric value empty\")\r\n",
    "    metric_value = metric_value.strip()\r\n",
    "    # remove % signs\r\n",
    "    metric_value = metric_value.replace(\"%\", \"\")\r\n",
    "    # convert m/M postfixes to numbers (e.g. 22M)\r\n",
    "    if metric_value[-1] in ['m', 'M']:\r\n",
    "        metric_value = metric_value[:-1]\r\n",
    "        metric_value = decimal.Decimal(\r\n",
    "            metric_value) * decimal.Decimal('1000000')\r\n",
    "    # convert k/K postfixes to numbers (e.g. 22k)\r\n",
    "    elif metric_value[-1] in ['k', 'K']:\r\n",
    "        metric_value = metric_value[:-1]\r\n",
    "        metric_value = decimal.Decimal(metric_value) * decimal.Decimal('1000')\r\n",
    "    metric_value = float(metric_value)\r\n",
    "    return metric_value\r\n",
    "\r\n",
    "\r\n",
    "def clean_ontology():\r\n",
    "    query(\"\"\"\r\n",
    "        WITH <tag:ITO>\r\n",
    "        DELETE { ?class rdfs:subClassOf ?redundant_superclass . }\r\n",
    "        WHERE {\r\n",
    "            ?class rdfs:subClassOf ?redundant_superclass .\r\n",
    "            ?class rdfs:subClassOf ?intermediate_class .\r\n",
    "            ?intermediate_class rdfs:subClassOf+ ?redundant_superclass .\r\n",
    "        }\r\n",
    "        \"\"\")\r\n",
    "\r\n",
    "    query(\"\"\"\r\n",
    "        WITH <tag:ITO>\r\n",
    "        DELETE { ?class rdfs:subClassOf owl:Thing . }\r\n",
    "        WHERE {\r\n",
    "            ?class rdfs:subClassOf ?someClass .\r\n",
    "            ?class rdfs:subClassOf owl:Thing .\r\n",
    "            FILTER (!sameTerm(?someClass, owl:Thing))\r\n",
    "        }\"\"\")\r\n",
    "\r\n",
    "    query(\"\"\"\r\n",
    "        prefix ito: <https://identifiers.org/ito:>\r\n",
    "\r\n",
    "        WITH <tag:ITO>\r\n",
    "        DELETE { ?class rdfs:subClassOf ?superclass . }\r\n",
    "        INSERT { ?class rdfs:subClassOf ito:ITO_00492 . }\r\n",
    "        WHERE {\r\n",
    "        ?class rdfs:subClassOf+ ito:ITO_01625 . \r\n",
    "        ?class rdfs:subClassOf ?superclass . \r\n",
    "        FILTER NOT EXISTS { \r\n",
    "            ?subclass rdfs:subClassOf* ?class .\r\n",
    "            ?subclass rdfs:subClassOf ito:Benchmarking . } \r\n",
    "        }\"\"\")\r\n",
    "\r\n",
    "    # Merge entities with the same papers_with_code_id value.\r\n",
    "\r\n",
    "    df = query_df('''\r\n",
    "        select (GROUP_CONCAT(?subject1) as ?subject1_concat) ?object from <tag:ITO> where { \r\n",
    "        ?subject1 ito:papers_with_code_id ?object .\r\n",
    "        ?subject2 ito:papers_with_code_id ?object .\r\n",
    "        filter ( ?subject1 != ?subject2 )\r\n",
    "        }\r\n",
    "        GROUP BY ?object\r\n",
    "        LIMIT 1000\r\n",
    "\r\n",
    "        ''')\r\n",
    "    for index, row in df.iterrows():\r\n",
    "        iris = row['subject1_concat'].split(' ')\r\n",
    "        query(\"\"\"\r\n",
    "            WITH <tag:ITO>\r\n",
    "            DELETE {<\"\"\" + iris[1] + \"\"\"> ?p ?o}\r\n",
    "            INSERT {<\"\"\" + iris[0] + \"\"\"> ?p ?o}\r\n",
    "            WHERE  {<\"\"\" + iris[1] + \"\"\"> ?p ?o}\r\n",
    "            \"\"\")\r\n",
    "\r\n",
    "        query(\"\"\"\r\n",
    "            WITH <tag:ITO>\r\n",
    "            DELETE { ?s ?p <\"\"\" + iris[1] + \"\"\">}\r\n",
    "            INSERT { ?s ?p <\"\"\" + iris[0] + \"\"\">}\r\n",
    "            WHERE  { ?s ?p <\"\"\" + iris[1] + \"\"\">}\r\n",
    "            \"\"\")\r\n",
    "\r\n",
    "        query(\"\"\"\r\n",
    "            WITH <tag:ITO>\r\n",
    "            DELETE { ?s <\"\"\" + iris[1] + \"\"\"> ?o}\r\n",
    "            INSERT { ?s <\"\"\" + iris[0] + \"\"\"> ?o}\r\n",
    "            WHERE  { ?s <\"\"\" + iris[1] + \"\"\"> ?o}\r\n",
    "            \"\"\")\r\n",
    "\r\n",
    "\r\n",
    "def escape(s):\r\n",
    "    return s.translate(str.maketrans({  \"'\":   r\"\\'\",\r\n",
    "                                        '\"':   r'\\\"',\r\n",
    "                                        \"\\\\\":  r\"\\\\\",\r\n",
    "                                        \"\\r\":  r\"\\r\",\r\n",
    "                                        \"\\n\":  r\"\\n\"}))"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "source": [
    "def create_new_class_from_paperswithcode(class_pwc_label, label=None, superclass=\"http://www.w3.org/2002/07/owl#Thing\", entity_type=\"class\", random_iri=False, flag_as_imported=True):\r\n",
    "    # Create a new class from paperswithcode input data, only if the class has not yet been added to the ontology\r\n",
    "\r\n",
    "    # Quick fix for rare cases where entities contain '*' wildcard character (historic, was required for Owlready2)\r\n",
    "    class_pwc_label = class_pwc_label.replace(\"*\", \"_\")\r\n",
    "\r\n",
    "    existing_matching_classes = query_entites_with_pwc_label(class_pwc_label)\r\n",
    "\r\n",
    "    if existing_matching_classes == None:\r\n",
    "\r\n",
    "        if random_iri:\r\n",
    "            iri = 'ITO_i' + \\\r\n",
    "                  ''.join(random.choices(string.ascii_letters + string.digits, k=16))\r\n",
    "        else:\r\n",
    "            iri = find_new_iri_fragment('https://identifiers.org/ito:ITO_')\r\n",
    "        \r\n",
    "        logfile.write(\r\n",
    "            f\"INFO: Creating an new entity for {class_pwc_label} ({iri}) \\n\")\r\n",
    "\r\n",
    "        if entity_type == \"individual\":\r\n",
    "            add_triple(f\"<{iri}> a <{superclass}>\")\r\n",
    "\r\n",
    "        elif entity_type == \"property\":\r\n",
    "            add_triple(f\"<{iri}> rdfs:subPropertyOf  <{superclass}>\")\r\n",
    "            add_triple(f\"<{iri}> a owl:DatatypeProperty\")\r\n",
    "            if flag_as_imported:\r\n",
    "                add_triple(f\"<{iri}> rdfs:subPropertyOf ito:Data_property_requiring_curation\")\r\n",
    "\r\n",
    "        elif entity_type == \"class\":\r\n",
    "            add_triple(f\"<{iri}> rdfs:subClassOf  <{superclass}>\")\r\n",
    "            add_triple(f\"<{iri}> a owl:Class\")\r\n",
    "            if flag_as_imported:\r\n",
    "                add_triple(f\"<{iri}> rdfs:subClassOf ito:Class_requiring_curation\")\r\n",
    "\r\n",
    "        else:\r\n",
    "            raise ValueError('Illegal entity_type argument')  \r\n",
    "\r\n",
    "        if flag_as_imported:\r\n",
    "            add_triple(f\"<{iri}> edam:refactor_comment 'IMPORTED'\")\r\n",
    "\r\n",
    "        add_triple(f\"<{iri}> obo:creation_date '{str(datetime.datetime.now().isoformat())}'^^xsd:dateTime\")\r\n",
    "\r\n",
    "        logfile.write(\r\n",
    "            f\"INFO: Created new entity for {class_pwc_label} ({iri})\\n\")\r\n",
    "\r\n",
    "        if label:\r\n",
    "            add_triple(f\"<{iri}> rdfs:label '{escape(label.strip())}'\")\r\n",
    "        else:\r\n",
    "            add_triple(f\"<{iri}> rdfs:label '{escape(class_pwc_label.strip())}'\")\r\n",
    "\r\n",
    "        add_triple(f\"<{iri}> ito:papers_with_code_id '{escape(class_pwc_label)}'\")\r\n",
    "\r\n",
    "        add_triple(f\"<{iri}> dc:source ito:Papers_with_code\")\r\n",
    "\r\n",
    "        return iri\r\n",
    "\r\n",
    "    else:\r\n",
    "        # logfile.write(f\"INFO: An entity for {class_pwc_label} already exists ({existing_matching_classes}) -- skipping entity creation\\n\")\r\n",
    "        return existing_matching_classes\r\n",
    "\r\n",
    "\r\n",
    "def add_superclass(myclass, superclass):\r\n",
    "    if not myclass == superclass:\r\n",
    "        add_triple(f\"<{myclass}> rdfs:subClassOf <{superclass}>\")"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "source": [
    "query(\"DROP GRAPH <tag:ITO>\")\r\n",
    "query(\"\"\"\r\n",
    "LOAD <file:///D:/Documents/Projekte/AI%20Strategies/ITO/ITO.owl> INTO GRAPH <tag:ITO>\r\n",
    "\"\"\")"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "b'<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\"><html><head><meta http-equiv=\"Content-Type\" content=\"text&#47;html;charset=UTF-8\"><title>blazegraph&trade; by SYSTAP</title\\n></head\\n><body<p>totalElapsed=12764ms, elapsed=12764ms, connFlush=0ms, batchResolve=0, whereClause=0ms, deleteClause=0ms, insertClause=0ms</p\\n><hr><p>COMMIT: totalElapsed=16810ms, commitTime=1628606373733, mutationCount=688346</p\\n></html\\n>'"
      ]
     },
     "metadata": {},
     "execution_count": 3
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "source": [
    "# Total triple count before purge\r\n",
    "\r\n",
    "query_df(\"SELECT (count(*) as ?triple_count) FROM <tag:ITO> WHERE {?s ?p ?o}\")"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>triple_count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>101572</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  triple_count\n",
       "0       101572"
      ]
     },
     "metadata": {},
     "execution_count": 5
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "source": [
    "# Purge existing benchmark result data / pre-July 2021 entities that became obsolete through new modeling\r\n",
    "\r\n",
    "query(\"\"\"\r\n",
    "WITH <tag:ITO>\r\n",
    "DELETE { ?s ?p ?o }\r\n",
    "WHERE {\r\n",
    "?s a/rdfs:subClassOf+ ito:Software .\r\n",
    "?s ?p ?o .\r\n",
    "}\r\n",
    "\"\"\")\r\n",
    "\r\n",
    "query(\"\"\"\r\n",
    "WITH <tag:ITO>\r\n",
    "DELETE { ?s ?p ?o }\r\n",
    "WHERE {\r\n",
    "?s rdfs:subClassOf+ ito:Software .\r\n",
    "?s ?p ?o .\r\n",
    "}\r\n",
    "\"\"\")\r\n",
    "\r\n",
    "query(\"\"\"\r\n",
    "WITH <tag:ITO>\r\n",
    "DELETE { ?s ?p ?o }\r\n",
    "WHERE {\r\n",
    "?s a/rdfs:subClassOf+ ito:Benchmarking .\r\n",
    "?s ?p ?o .\r\n",
    "}\r\n",
    "\"\"\")"
   ],
   "outputs": [
    {
     "output_type": "stream",
     "name": "stderr",
     "text": [
      "C:\\Users\\samwa\\anaconda3\\envs\\pwc-conversion\\lib\\site-packages\\SPARQLWrapper\\Wrapper.py:1346: RuntimeWarning: unknown response content type 'text/html;charset=utf-8' returning raw response...\n",
      "  warnings.warn(\"unknown response content type '%s' returning raw response...\" %(ct), RuntimeWarning)\n"
     ]
    },
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "b'<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\"><html><head><meta http-equiv=\"Content-Type\" content=\"text&#47;html;charset=UTF-8\"><title>blazegraph&trade; by SYSTAP</title\\n></head\\n><body<p>totalElapsed=338ms, elapsed=336ms, connFlush=0ms, batchResolve=0, whereClause=335ms, deleteClause=0ms, insertClause=335ms</p\\n><hr><p>COMMIT: totalElapsed=361ms, commitTime=1628147160555, mutationCount=0</p\\n></html\\n>'"
      ]
     },
     "metadata": {},
     "execution_count": 6
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "source": [
    "clean_ontology()"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "source": [
    "# Total triple count after purge\n",
    "\n",
    "query_df(\"SELECT (count(*) as ?triple_count) FROM <tag:ITO> WHERE {?s ?p ?o}\")"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>triple_count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>65426</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  triple_count\n",
       "0        65426"
      ]
     },
     "metadata": {},
     "execution_count": 8
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "source": [
    "# Download and read PWC data dump\n",
    "\n",
    "filename = './evaluation-tables.json.gz'\n",
    "if not os.path.exists(filename):\n",
    "    url = 'https://paperswithcode.com/media/about/evaluation-tables.json.gz'\n",
    "    myfile = requests.get(url)\n",
    "    open(filename, 'wb').write(myfile.content)\n",
    "    with gzip.open(filename, 'rb') as f_in:\n",
    "        with open('./evaluation-tables.json', 'wb') as f_out:\n",
    "            shutil.copyfileobj(f_in, f_out)\n",
    "\n",
    "with open('evaluation-tables.json') as f:\n",
    "    data = json.load(f)\n"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "source": [
    "# Set this values based on highest IRI in current ontology to save some startup time\n",
    "iri_increment = 17000\n",
    "logfile = open(\"logfile.txt\", \"w\", encoding=\"utf-8\")\n",
    "failed_rows = 0"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "source": [
    "ai_process_class = \"https://identifiers.org/ito:ITO_01625\"\n",
    "\n",
    "def create_task_class(task, depth=0, superclass=None):\n",
    "    logfile.write(\n",
    "        f\"INFO: Processing task to create class hierarchy: {task['task']}\\n\")\n",
    "\n",
    "    # Create class\n",
    "\n",
    "    task_class = create_new_class_from_paperswithcode(task['task'])\n",
    "\n",
    "    for category in task['categories']:\n",
    "        categories_class = create_new_class_from_paperswithcode(category, superclass = ai_process_class)\n",
    "        # add_superclass(categories_class, ai_process_class)\n",
    "        if not categories_class == task_class:   # in some cases category name and task name are equal; this would create a cycle that we need to avoid\n",
    "            add_superclass(task_class, categories_class)\n",
    "    if superclass:\n",
    "        add_superclass(task_class, superclass)\n",
    "\n",
    "    for subtask in task['subtasks']: \n",
    "        create_task_class(subtask, depth + 1, superclass = task_class)\n",
    "\n",
    "\n",
    "for task in data:\n",
    "    #logfile.write(f\"INFO: Creating task class for  {task['task']}\\n\")\n",
    "    create_task_class(task)"
   ],
   "outputs": [
    {
     "output_type": "stream",
     "name": "stderr",
     "text": [
      "C:\\Users\\samwa\\anaconda3\\envs\\pwc-conversion\\lib\\site-packages\\SPARQLWrapper\\Wrapper.py:1346: RuntimeWarning: unknown response content type 'text/html;charset=utf-8' returning raw response...\n",
      "  warnings.warn(\"unknown response content type '%s' returning raw response...\" %(ct), RuntimeWarning)\n"
     ]
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "source": [
    "clean_ontology()"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "source": [
    "hashed_result_rows = set()   # PWC benchmark data contains duplicates, we make a set of hashes of results to avoid adding the same result more than once.\n",
    "\n",
    "article_class = \"http://edamontology.org/data_0971\"\n",
    "\n",
    "def process_task(task, depth=0, superclass=None):\n",
    "    global failed_rows\n",
    "\n",
    "    task_class = create_new_class_from_paperswithcode(task['task'])\n",
    "\n",
    "    # Add process definitions -- TODO: THIS PROBABLY LEADS TO DUPLICATES IF MINOR CHANGES IN PWC DESCRIPTIONS WERE INTRODUCED\n",
    "\n",
    "    description = str(task['description']).split('<span')[0].strip()  # remove image attributions\n",
    "    description = re.sub('<[^<]+?>', '', description)  # strip HTML\n",
    "    if description and len(description) < 800:\n",
    "        description += \" (Source: paperswithcode.com)\"\n",
    "        add_triple(f\"<{task_class}> obo:hasDefinition '{escape(description)}'\")\n",
    "\n",
    "    # Convert benchmark results data\n",
    "\n",
    "    for dataset in task['datasets']:\n",
    "        #dataset['dataset'] = dataset['dataset'].encode('utf-8').decode('utf-8')\n",
    "        #print('decoded: ',dataset['dataset'])\n",
    "        \n",
    "        dataset_entity = create_new_class_from_paperswithcode(\n",
    "            dataset['dataset'] + ' dataset', superclass=\"https://identifiers.org/ito:Benchmark_dataset\", entity_type=\"individual\")\n",
    "        logfile.write(f\"Dataset_entity: {dataset_entity}\\n\")\n",
    "\n",
    "        benchmark_pwc_label = dataset['dataset'] + ' - ' + query_label(task_class) + ' benchmarking'\n",
    "\n",
    "        logfile.write(f\"benchmark_pwc_label: {benchmark_pwc_label}\\n\")\n",
    "\n",
    "        benchmark_class = create_new_class_from_paperswithcode(benchmark_pwc_label, superclass = \"https://identifiers.org/ito:Benchmarking\", flag_as_imported = False)\n",
    "        if not benchmark_class == task_class:    # in rare cases the benchmark and task class end up the same - TODO: Deal with this better\n",
    "            add_superclass(benchmark_class, task_class)\n",
    "        #add_superclass(benchmark_class, \"https://identifiers.org/ito:Benchmarking\")\n",
    "\n",
    "        for metric in dataset['sota']['metrics']:\n",
    "            metric_property = create_new_class_from_paperswithcode(\n",
    "                metric + \" property\", metric, superclass=\"https://identifiers.org/ito:performance_measure\", entity_type=\"property\")\n",
    "\n",
    "            add_triple(f\"<{benchmark_class}> rdfs:seeAlso <{metric_property}>\")\n",
    "\n",
    "        for row in dataset['sota']['rows']:\n",
    "            #row_entity = benchmark_class(0) ############\n",
    "            hashed_row = hash(str(row))\n",
    "            if hashed_row in hashed_result_rows:\n",
    "                logfile.write(f\"INFO: Skipping duplicate result row, hash {hashed_row}\\n\")\n",
    "            else:\n",
    "                hashed_result_rows.add(hashed_row)\n",
    "\n",
    "                row_entity = 'https://identifiers.org/ito:ITO_i' + ''.join(random.choices(string.ascii_letters + string.digits, k=16)) # create random IRI\n",
    "                add_triple(f\"<{row_entity}> a <{benchmark_class}>\")\n",
    "\n",
    "                if not row['model_name']:\n",
    "                    logfile.write(\"WARNING: Model name missing, skipping row\\n\")\n",
    "                    failed_rows += 1\n",
    "                    continue\n",
    "\n",
    "                for metric, value in row['metrics'].items():\n",
    "                    cleaned_metric_value = None\n",
    "                    try:\n",
    "                        cleaned_metric_value = clean_metric_value(value)\n",
    "                    except (ValueError, decimal.InvalidOperation):\n",
    "                        logfile.write(\n",
    "                            f\"ERROR: Could not convert metric value: {metric} {value}\\n\")\n",
    "\n",
    "                    if cleaned_metric_value:\n",
    "                        metric_property = create_new_class_from_paperswithcode(\n",
    "                            metric + \" property\", metric, superclass=\"https://identifiers.org/ito:performance_measure\", entity_type=\"property\")\n",
    "                        add_triple(f\"<{row_entity}> <{metric_property}> {cleaned_metric_value}\")\n",
    "\n",
    "                \n",
    "                software_entity = create_new_class_from_paperswithcode(row['model_name'] + \" software\", row['model_name'], superclass=\"https://identifiers.org/ito:Software\", entity_type=\"individual\")\n",
    "\n",
    "                add_triple(f\"<{row_entity}> rdfs:seeAlso <{software_entity}>\")\n",
    "                add_triple(f\"<{row_entity}> ito:has_input <{dataset_entity}>\")\n",
    "\n",
    "                if row['paper_title']:\n",
    "                    row_entity_label = row['model_name'] + \" model in '\" + row['paper_title'] + \"'\"        \n",
    "                    row_entity_label = escape(row_entity_label.strip()) \n",
    "\n",
    "                    add_triple(f\"<{row_entity}> rdfs:label '{escape(row_entity_label)}'\")\n",
    "\n",
    "                    article_entity = create_new_class_from_paperswithcode(row['paper_url'], row['paper_title'], superclass=article_class, entity_type=\"individual\")\n",
    "\n",
    "                    add_triple(f\"<{article_entity}> foaf:page <{row['paper_url']}>\")\n",
    "\n",
    "                    add_triple(f\"<{row_entity}> rdfs:seeAlso <{article_entity}>\")\n",
    "                    add_triple(f\"<{software_entity}> rdfs:seeAlso <{article_entity}>\")\n",
    "\n",
    "\n",
    "                    try:\n",
    "                        paper_date = datetime.datetime.strptime(row['paper_date'], '%Y-%m-%d').date()\n",
    "                        \n",
    "                        add_triple(f\"<{row_entity}> obo:date '{paper_date}'^^xsd:date\")\n",
    "                        add_triple(f\"<{article_entity}> obo:date '{paper_date}'^^xsd:date\")\n",
    "\n",
    "                    except TypeError:\n",
    "                        logfile.write(\"ERROR: No valid date found\\n\")\n",
    "                else:\n",
    "                    add_triple(f\"<{row_entity}> rdfs:label '{escape(row['model_name'])}'\")\n",
    "\n",
    "                for code_link in row['code_links']:\n",
    "                    add_triple(f\"<{row_entity}> rdfs:seeAlso '{code_link['url']}'\")\n",
    "\n",
    "    # Recursively iterate through subtasks\n",
    "\n",
    "    for subtask in task['subtasks']:\n",
    "        process_task(subtask, depth + 1, superclass=task_class)\n",
    "\n",
    "\n",
    "#logfile.write(f\"INFO: Failed rows: {failed_rows}\\n\")\n",
    "#logfile.write(f\"INFO: Final iri_increment value: {iri_increment}\\n\")\n",
    "\n",
    "for task in data:\n",
    "    logfile.write(f\"INFO: Processing benchmark results for {task['task']}\\n\")\n",
    "    process_task(task)"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "source": [
    "clean_ontology()"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [
    "# END OF MAIN SCRIPT, SCRATCHPAD FOLLOWS"
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [
    "query_df('SELECT ?x FROM <tag:ITO> WHERE { ?x ito:papers_with_code_id \"SSIM property\" }')"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [
    "query_df('''\n",
    "select * from <tag:ITO> where { \n",
    "  ?subject ito:papers_with_code_id ?object1, ?object2 .\n",
    "  filter ( ?object1 != ?object2 )\n",
    "}\n",
    "LIMIT 1000\n",
    "\n",
    "''')"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [
    "# SPARQL examples"
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [
    "query(\"CREATE GRAPH <https://samwald.info/graph>\")\n",
    "query(\"INSERT DATA { GRAPH <https://samwald.info/graph> { <http://example/book1> dc:title 'A new book' }  } \")\n",
    "#query(\"SELECT * WHERE { <http://example/book1> ?b ?c . } \")\n",
    "#query(\"DELETE DATA { GRAPH <https://samwald.info/graph> { <http://example/book1> dc:title 'A new book' }  } \")"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [
    "query_df(\"SELECT * WHERE { <http://example/book1> ?b ?c . } \")"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [
    "query_df(\"\"\"\n",
    "SELECT ?g \n",
    "WHERE {\n",
    "  GRAPH ?g { }\n",
    "}\n",
    "\"\"\")"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [
    "query(\"INSERT DATA { GRAPH <tag:ITO_new> { <http://example/book1> dc:title 'An alternative title!!' }  } \")"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [
    "query(\"SELECT * FROM <tag:ITO_new> WHERE { <http://example/book1> ?b ?c . } \")"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [
    "query(\"CREATE GRAPH <tag:ITO_old>\")"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [
    "escape(r\" el in 'Multiway Attention Networks for Modeling Sentence Pairs' \")"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [
    "def escape2(s):\n",
    "    return s.translate(str.maketrans({  \"\\\\\":  r\"\\\\\",\n",
    "                                        \"'\":   r\"\\'\",\n",
    "                                        '\"':   r'\\\"',\n",
    "                                        \"\\r\":  r\"\\r\",\n",
    "                                        \"\\n\":  r\"\\n\"}))"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [
    "escape2(r\" el \\ in 'Multiway Attention Networks for Modeling Sentence Pairs' \")"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [
    "r\" el \\ in 'Multiway Attention Networks for Modeling Sentence Pairs' \""
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [],
   "outputs": [],
   "metadata": {}
  }
 ]
}